//====================================================================================
//                       constant.h
//                            by Shinsuke MORI
//                            Last change : 4 June 1999
//====================================================================================

// 機  能 : 単語 n-gram モデルによる自動単語分割器のための定数の設定
//
// 注意点 : なし


//------------------------------------------------------------------------------------
//                       define
//------------------------------------------------------------------------------------

#ifndef _constant_h
#define _constant_h


//------------------------------------------------------------------------------------
//                       constant
//------------------------------------------------------------------------------------

const U_INT4   CharAlphabetSize = 6878;           // EUC コードの文字アルファベット数
const U_INT4   YomiAlphabetSize = 369;            // 仮名漢字変換の入力の文字の数
const U_INT4   KKCIAlphabetSize = 154;            // scalar(@KKCInput)
const U_INT4   MAXLEN = 0x200;                    // 処理できる入力文の長さの最大値
const U_INT4   UkWordMaxLen = 10;                 // 未知語の最大の長さ
const U_INT4   UkYomiMaxLen = 10;                 // 未知読みの最大の長さ

const U_INT4   UT = 0;
const U_INT4   BT = 1;

// 2009/01/05 comment out
// const U_INT4   CharTypeSize = 6;               // 文字クラスの数

const U_INT4   BEAM = 8;                          // 探索の幅

      U_INT4   SERVERMAXLEN = 128;                // 処理できる入力文の長さの最大値

const S_INT2   MULT = 4096;                       // -log P の倍率


//------------------------------------------------------------------------------------
//                       endif
//------------------------------------------------------------------------------------

#endif


//====================================================================================
//                       END
//====================================================================================
